﻿﻿﻿﻿﻿﻿﻿﻿﻿﻿﻿﻿﻿﻿﻿﻿﻿﻿﻿﻿﻿﻿﻿﻿﻿﻿﻿﻿﻿﻿﻿﻿/=#
#include "VFR.uni"

//---------------------------------------------------------------------------
// Digital IO Port Configuration
//---------------------------------------------------------------------------
#string STR_UARTMODE_FORM			#language eng "UART Mode Configuration"
#string STR_UARTMODE_FORM_HELP			#language eng "UART Mode Configuration"

#string STR_AAEON_UARTMODE_CALLBACK		#language eng "Item for a setup callback"
#string STR_AAEON_UARTMODE_DUMMY		#language eng "N/A"

#string STR_AAEON_UARTMODE_TRANSCEIVER		#language eng "UART Mode Transceiver"
#string STR_AAEON_UARTMODE_TRANSCEIVER_HELP	#language eng "UART Mode Transceiver selection"
#string STR_AAEON_UARTMODE_TRANSCEIVER_F81438		#language eng "F81438"
#string STR_AAEON_UARTMODE_TRANSCEIVER_HW_DESIGN	#language eng "HW Design"

#string STR_AAEON_UARTMODE_SOURCE		#language eng "  GPIO Source"
#string STR_AAEON_UARTMODE_SOURCE_HELP		#language eng "GPIO Source chip selection"

#string STR_AAEON_UARTMODE_UART_SOURCE       #language eng "  UART Source"
#string STR_AAEON_UARTMODE_SOURCE_HELP      #language eng "UART Source chip selection"

#string STR_AAEON_UARTMODE_UID			#language eng "  UART UID Number"
#string STR_AAEON_UARTMODE_UID_HELP		#language eng "UID Number for target UART"

#string STR_AAEON_UARTMODE			#language eng "  UART Mode Support"
#string STR_AAEON_UARTMODE_HELP			#language eng "UART Mode Support Enabled/Disabled"

#string STR_AAEON_UARTMODE_GPIO0		#language eng "  GPIO 0 Number"
#string STR_AAEON_UARTMODE_GPIO0_HELP		#language eng "GPIO 0 Number\nF81438: MODE_1\nHW Design: ENRS232\nEx: Fill 76 if it comes from GPIO76"

#string STR_AAEON_UARTMODE_GPIO1		#language eng "  GPIO 1 Number"
#string STR_AAEON_UARTMODE_GPIO1_HELP		#language eng "GPIO 1 Number\nF81438: MODE_2\nHW Design: EN422#\nEx: Fill 76 if it comes from GPIO76"

#string STR_AAEON_UARTMODE_GPIO2		#language eng "  GPIO 2 Number"
#string STR_AAEON_UARTMODE_GPIO2_HELP		#language eng "GPIO 2 Number\nHW Design: EN485#\nEx: Fill 76 if it comes from GPIO76"

#string STR_AAEON_UARTMODE_1			#language eng "UART Control 1"
#string STR_AAEON_UARTMODE_2			#language eng "UART Control 2"
#string STR_AAEON_UARTMODE_3			#language eng "UART Control 3"
#string STR_AAEON_UARTMODE_4			#language eng "UART Control 4"
#string STR_AAEON_UARTMODE_5			#language eng "UART Control 5"
#string STR_AAEON_UARTMODE_6			#language eng "UART Control 6"
#string STR_AAEON_UARTMODE_7			#language eng "UART Control 7"
#string STR_AAEON_UARTMODE_8			#language eng "UART Control 8"
#string STR_AAEON_UARTMODE_9			#language eng "UART Control 9"
#string STR_AAEON_UARTMODE_10			#language eng "UART Control 10"

#string STR_AAEON_UARTMODE_DEFAULT		#language eng "  UART Mode Default"
#string STR_AAEON_UARTMODE_DEFAULT_HELP	#language eng "Default setting for target UART Mode setup item"
#string STR_AAEON_RS232					#language eng "RS232"
#string STR_AAEON_RS422					#language eng "RS422"
#string STR_AAEON_RS485					#language eng "RS485"